app/controllers/user_controller.rb

  def index
    #user profile
    @today_record = Record.where(:user_id => current_user.id)

    @user = current_user.name
    @steps = @today_record.pluck(:steps).first
    @sleep = @today_record.pluck(:sleep).first
    @meditated = @today_record.pluck(:meditation).first
    @enjoyment = @today_record.pluck(:enjoyment).first
    @achievement = @today_record.pluck(:achievement).first
---
SELECT  "records".* FROM "records" WHERE "records"."user_id" = $1 ORDER BY "records"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "records"."steps" FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]
SELECT "records"."sleep" FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]
SELECT "records"."meditation" FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]
SELECT "records"."enjoyment" FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]
SELECT "records"."achievement" FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]

  def team
    @team = Team.where(:id => current_user.team).first

    @team_name = @team.name

    @leaders = User.where(:team_id => current_user.team).order("score DESC").first(3)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" IS NULL ORDER BY "teams"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."team_id" = 2 ORDER BY "users"."score" ASC, asc LIMIT $1  [["LIMIT", 3]]

  def history
    @history = Record.where(:user_id => current_user.id).order("date DESC")
---
SELECT "records".* FROM "records" WHERE "records"."user_id" = 2 ORDER BY date DESC